package LDUBGD.DSNS.aid;

import org.telegram.telegrambots.meta.api.objects.replykeyboard.ReplyKeyboardMarkup;
import org.telegram.telegrambots.meta.api.objects.replykeyboard.buttons.KeyboardRow;

import java.util.ArrayList;
import java.util.List;

public class Burns {
    //меню опіки
    private ReplyKeyboardMarkup keyboardBurns(){
        //створюємо клавіатуру
        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        replyKeyboardMarkup.setSelective(true);
        replyKeyboardMarkup.setResizeKeyboard(true);
        replyKeyboardMarkup.setOneTimeKeyboard(false);
        //створюємо список рядків клавіатури
        List<KeyboardRow> keyBoardBurnsRows = new ArrayList<>();
        //створюємо перший рядок клавіатури
        KeyboardRow keyboardRow = new KeyboardRow();
        keyboardRow.add("Термічний опік\uD83C\uDF21");
        keyboardRow.add("Хімічний опік⚠️");
        //створюємо другий рядок клавіатури
        KeyboardRow keyboardSecondRow = new KeyboardRow();
        keyboardSecondRow.add("Електричний опік⚡️");
        keyboardSecondRow.add("Обмороження\uD83E\uDD76");
        //створюємо третій рядок
        KeyboardRow keyboardThirdRow = new KeyboardRow();
        keyboardThirdRow.add("Повернутися⬅");
        keyboardThirdRow.add("Меню");
        //додаємо всі рядки в наш список
        keyBoardBurnsRows.add(keyboardRow);
        keyBoardBurnsRows.add(keyboardSecondRow);
        keyBoardBurnsRows.add(keyboardThirdRow);
        //додаємо цей список нашій клавіатурі
        replyKeyboardMarkup.setKeyboard(keyBoardBurnsRows);
        return replyKeyboardMarkup;
    }
    public ReplyKeyboardMarkup getKeyboardBurns(){
        return keyboardBurns();
    }
    //опік
    private String burns(){
        String text = "Опіки⛑ \n\n";
        text +="\uD83D\uDD38 Опіки - це ушкодження м'яких тканин, які отримані під дією високих температур, хімічних речовин, дії електричного струму або сонячних променів. \n\n";
        text +="\uD83D\uDD38 Тяжкість опіків залежить від фактора, що спричинив ушкодження, місцеполощення на тілі, обсягу ушкодження, віку постраждалого та стану його здоров'я.\n\n";
        text +="\uD83D\uDD38 За глибиною ураження тканини опіки можна умовно розділити на поверхневі, помірно глибокі та глибокі. У лікарській практиці це відповідає опікам І-го(почервонянням шкіри) , ІІ-го(появою пухирів) та ІІІ–ІV-го(обвуглюванням шкіри та ураженням нижніх шарів тканини) ступенів відповідно.\n\n";
        return text;
    }
    public String getBurns(){
        return burns();
    }

    //термічні опіки
    private String thermalBurns(){
        String text = "Термічні опіки\uD83C\uDF21 \n\n";
        text += "\uD83D\uDD38 При опіках I ступеня (почервоніння) обпечене місце обробляють антисептичними засобами та етиловим спиртом. \n";
        text += "\uD83D\uDD38 При опіках II ступеня (пухирі) обпечене місце обробляють спиртом або 3% марганцевим розчином. \n";
        text += "\uD83D\uDD38 При опіках III ступеня (ушкодження шкіряної тканини) рану накривають стерильною пов’язкою та викликають медичного працівника.\n\n";
        text += "ЗАБОРОНЯЄТЬСЯ❗: \n\n";
        text += "❗️ Знімати одяг з обпечених місць – це може травмувати шкіру ще більше. \n";
        text += "❗️ Прикладати до рани лід – це додатковий травмуючий фактор. \n";
        text += "❗️ Обробляти рану підручними засобами: олією, сметаною, будь-якими кремами тощо. Вони утворюють на поверхні шкіри плівку і перешкоджають доступу кисню, через що локально підвищується температура, і ураження розповсюджується вглиб тканин. \n";
        text += "❗️ Проколювати пухирі – це ще один шлях до зараження рани та додаткового травмування тканин. \n\n";
        return text;
    }
    public String getThermalBurns(){
        return thermalBurns();
    }

    //хімічні опіки
    private String chemicalBurns(){
        String text = "Хімічні опіки⚠ \n\n";
        text += "\uD83D\uDD38 Якнайшвидше зменшити концентрацію хімічної речовини та час її дії на потерпілого. \n";
        text += "\uD83D\uDD39 При потраплянні кислоти або лугу на шкіру, ушкоджені ділянки шкіри слід промивати проточною водою з-під крана, гумового шланга або відра протягом 15–20 хвилин, після цього пошкоджену кислотою поверхню обмити 5% розчином питної соди, а обпечену лугом — 3% розчином борної кислоти або розчином оцтової кислоти. Якщо кислота або луг потрапили на шкіру через одяг, то спочатку слід змити їх водою з одягу, потім обережно розрізати і зняти з потерпілого мокрий одяг, після чого промити шкіру.\n";
        text += "\uD83D\uDD39 При потраплянні на слизову оболонку очей кислоти або лугу очі необхідно промивати цівкою води протягом 15–20 хвилин, після цього промити 2% розчином питної соди, а при ураженні очей лугом — 2% розчином борної кислоти. \n";
        text += "\uD83D\uDD39 При потраплянні в дихальні шляхи необхідно дихати розпиленим за допомогою пульверизатора 10% розчином питної соди, при потраплянні лугу — розпиленим 3% розчином борної кислоти.\n";
        return text;
    }
    public String getChemicalBurns(){
        return chemicalBurns();
    }

    //електричні опіки
    private String electricBurns(){
        String text = "Електричні опіки⚡ \n\n";
        text += "\uD83D\uDD38 Крок 1. Для зняття болю слід дати потерпілому знеболювальне (наприклад, амідопірин (0,5 г) чи анальгін (0,5–1 г)).  \n";
        text += "\uD83D\uDD38 Крок 2. Уникаючи травмування обпеченої ділянки тіла, на уражену ділянку слід накласти суху антисептичну пов’язку.  \n\n";
        text += "УВАГА❗ Не дозволяється промивання опіку етиловим спиртом та самостійне зняття залишків горілого одягу.\n\n";
        text += "❗️ При опіку очей електричною дугою необхідно накласти холодну примочку із розчином борної кислоти. \n";
        text += "❗️ У випадку опікового шоку потерпілого слід зігріти. Не можна зривати пухирі, видаляти з обпеченого місця мастику, каніфоль та інші смолисті речовини (за їх наявності), оскільки під час їх видалення можна здерти обпечену шкіру, що може призвести до зараження рани. \n";
        return text;
    }
    public String getElectricBurns(){
        return electricBurns();
    }
    private String frostbite(){
        String text = "Обмороження\uD83E\uDD76 \n\n";
        text += "\uD83D\uDD38 Крок 1. У разі обмороження кінцівок необхідно віднести потерпілого у тепле приміщення, зняти верхній одяг та взуття. Якщо взуття не знімається — його слід розрізати.\n";
        text += "\uD83D\uDD38 Крок 2. Pозтирати збілілі ділянки шкіри до почервоніння і появи відчуття поколювання. Можна розтирати сухою фланелевою або м’якою шерстяною тканиною. Уражене місце можна змастити лікувальними засобами (наприклад, мазями «Пантенол», «Рятівник»). Неможна проколювати пухирі;\n";
        text += "\uD83D\uDD38 Крок 3. Дати випити багато теплої безалькогольної рідини. \n ";
        return text;
    }
    public String getFrostbite(){
        return frostbite();
    }
}
