package LDUBGD.DSNS.aid;


public class GunshotWound {

    //вогнепальне поранення
    private String gunshotWound(){
        String text = "Перша допомога⛑\n\n ";
        text += "\uD83D\uDD38 Крок 1. Постраждалого потрібно розмістити так, щоб рана була вище рівня серця: \n ";
        text += "- кінцівки потрібно підняти(за умови, що немає травм хребта), а якщо куля потрапила в бік, то перевернути пораненим боком наверх.\n\n ";
        text += "\uD83D\uDD38 Крок 2. Зупинити кровотечу: \n";
        text += "- перев'язати рану тугою пов'язкою або притиснути руками. Складіть тканину в кілька шарів і зав'яжіть на рані.\n ";
        text += "Здавлюйте не менше 10 хвилин. Періодично міняйте пов'язку на чисту\n\n ";
        text += "\uD83D\uDD38 Крок 3. Надайте постраждалому спокій: \n ";
        text += "- у пораненого може з'явитися больовий шок. Накрийте потерпілого теплими речима,говоріть з ним. Якщо людина втратила свідомість і не дихає - робіть СЛР\n\n ";
        text += "УВАГА❗ Не намагайтеся витягнути кулю з тіла самостійно! ";
        return text;
    }
    public String getGunshotWound(){
        return gunshotWound();
    }
}
