package LDUBGD.DSNS.aid;

public class TraumaticBrainInjury {
    //ЧМТ
    private String traumaticBrainInjury(){
        String text = " Черепно-мозкова травма\n\n";
        text += "Ознаки : \n";
        text += "\uD83D\uDD39 рани, синці в області голови та обличчя;\n";
        text += "\uD83D\uDD39 сплутанність, втрата свідомості;\n";
        text += "\uD83D\uDD39 сильний біль або відчуття тиску в голові;\n";
        text += "\uD83D\uDD39 поколювання або втрата чутливості в пальцях рук та ніг;\n";
        text += "\uD83D\uDD39 деформація в області голови;\n";
        text += "\uD83D\uDD39 утруднене дихання;\n";
        text += "\uD83D\uDD39 порушення зору;\n\n";
        text += "Домедична допомога:\n ";
        text += "\uD83D\uDD38 Крок 1. Зафіксувати шийний відділ хребта(шийний комірець, м'яка тканина, фіксація руками).\n";
        text += "\uD83D\uDD38 Крок 2. Провести огляд постраждалого, визначити наявність свідомості, дихання.\n";
        text += "\uD83D\uDD38 Крок 3. Викликати бригаду екстреної(швижкої) медичної допомоги.\n";
        text += "\uD83D\uDD38 Крок 4. За відсутності дихання - проводити СЛР.\n";
        text += "\uD83D\uDD38 Крок 5. Якщо у постраждалого є рани в області голови - накласти пов'язки на рани; \n";
        text += "\uD83D\uDD38 Крок 6. Вкрити постраждалого термопокривалом/ковдрою;\n";
        text += "\uD83D\uDD38 Крок 7. Підтримати постраждалого психологічно;\n";
        text += "\uD83D\uDD38 Крок 8. Забезпечити постійний нагляд за постраждалим до прибуття бригади екстреної (швидкої) медичної допомоги\n";
        text += "\uD83D\uDD38 Крок 9. При погіршенні стану постраждалого зателефонувати до диспетчера екстреної медичної допомоги, дотримуватись його рекомендацій;\n\n";
        return text;
    }
    public String getTraumaticBrainInjury(){
        return traumaticBrainInjury();
    }
}
