package LDUBGD.DSNS.services;

import org.telegram.telegrambots.meta.api.objects.replykeyboard.ReplyKeyboardMarkup;
import org.telegram.telegrambots.meta.api.objects.replykeyboard.buttons.KeyboardRow;

import java.util.ArrayList;
import java.util.List;

public class ActionInEmergencies {
    private String actionInEmergencies(){
        return "Безпека — меню\n" +
                "\n" +
                "Щоб завантажити брошуру з техніки безпеки, надішліть відповідь «брошура».\n" +
                "\n" +
                "Оберіть відповідний номер\n" +
                "\n" +
                "✅  Підготуйся до надзвичайних ситуацій\n" +
                "\n" +
                "201. Поради до підготовки вдома\n" +
                "\n" +
                "202. Як мінімізувати ризик загубитись членам сім'ї\n" +
                "\n" +
                "203. Підготуйте свою «Екстрену валізу»\n" +
                "\n" +
                "\n" +
                "\uD83D\uDEA8  Сигнал тривоги\n" +
                "\n" +
                "204. Завантажити застосунок Повітряна тривога\n" +
                "\n" +
                "205. Що робити, після отримання сигналу «увага всім»\n" +
                "\n" +
                "\n" +
                "\uD83C\uDD98 Надзвичайна ситуація або зона бойових дій\n" +
                "\n" +
                "206. Що робити, в надзвичайній ситуації або в зоні бойових діи\n" +
                "\n" +
                "207. Що робити, під час обстрілу стрілецькою зброєю\n" +
                "\n" +
                "208. Що робити, під час артобстрілів\n" +
                "\n" +
                "209. Що має бути в аптечці\n" +
                "\n" +
                "210. Що робити, коли дитина під впливом сильного страху?\n" +
                "\n" +
                "211. Що робити, якщо стався завал у будинку\n" +
                "\n" +
                "212. Що робити, якщо ти помітив підозрілий предмет або вибухівку?\n" +
                "\n" +
                "213. У разі небезпеки вибуху\n" +
                "\n" +
                "214. \"Гарячі лінії\" та центри допомоги\n" +
                "\n" +
                "215. Правила поведінки під час комендантської години\n" +
                "\n" +
                "216. Як діяти при обстрілах житлових будинків?\n" +
                "\n" +
                "\n" +
                "☢️ Радіація або хімічне забруднення\n" +
                "\n" +
                "217. Карта радіаційного фону\n" +
                "\n" +
                "218. Твої дії у випадку радіаційної загрози\n" +
                "\n" +
                "219. Твої дії у випадку хімічної загрози\n" +
                "\n" +
                "220. Заходи безпеки при поверненні з зони хімічного / біологічного / радіаційного забруднення\n" +
                "\n" +
                "\n" +
                "\uD83D\uDCF1 Комунікація та дезінформація\n" +
                "\n" +
                "221. Як не стати жертвою дезінформації\n" +
                "\n" +
                "222. Способи комунікації за відсутності мобільного зв'язку";
    }
    public String getActionImEmergencies(){
        return actionInEmergencies();
    }

    private ReplyKeyboardMarkup keyboardActionInEmergencies() {
        //створюємо клавіатуру
        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        replyKeyboardMarkup.setSelective(true);
        replyKeyboardMarkup.setResizeKeyboard(true);
        replyKeyboardMarkup.setOneTimeKeyboard(false);
        //створюємо список рядків клавіатури
        List<KeyboardRow> keyboardRows = new ArrayList<>();
        //створюємо перший рядок
        KeyboardRow keyboardRow = new KeyboardRow();
        keyboardRow.add("201");
        keyboardRow.add("202");
        keyboardRow.add("203");
        //створюємо другий рядок
        KeyboardRow keyboardSecondRow = new KeyboardRow();
        keyboardSecondRow.add("204");
        keyboardSecondRow.add("205");
        keyboardSecondRow.add("206");
        //створюємо третій рядок
        KeyboardRow keyboardThirdRow = new KeyboardRow();
        keyboardThirdRow.add("207");
        keyboardThirdRow.add("208");
        keyboardThirdRow.add("209");
        //створюємо четвертий рядок
        KeyboardRow keyboardFourthRow = new KeyboardRow();
        keyboardFourthRow.add("210");
        keyboardFourthRow.add("211");
        keyboardFourthRow.add("212");
        //створюємо п'ятий рядок
        KeyboardRow keyboardFifthRow = new KeyboardRow();
        keyboardFifthRow.add("213");
        keyboardFifthRow.add("214");
        keyboardFifthRow.add("215");
        //створюємо шостий рядок
        KeyboardRow keyboardSixthRow = new KeyboardRow();
        keyboardSixthRow.add("216");
        keyboardSixthRow.add("217");
        keyboardSixthRow.add("218");
        //створюємо сьомий рядок
        KeyboardRow keyboardSeventhRow = new KeyboardRow();
        keyboardSeventhRow.add("219");
        keyboardSeventhRow.add("220");
        keyboardSeventhRow.add("221");
        //створюємо восьмий рядок
        KeyboardRow keyboardEighthRow = new KeyboardRow();
        keyboardEighthRow.add("222");
        //створюємо восьмий рядок
        KeyboardRow keyboardNinthRow = new KeyboardRow();
        keyboardNinthRow.add("Меню");
        //встановлюємо всі рядки в наш список
        keyboardRows.add(keyboardRow);
        keyboardRows.add(keyboardSecondRow);
        keyboardRows.add(keyboardThirdRow);
        keyboardRows.add(keyboardFourthRow);
        keyboardRows.add(keyboardFifthRow);
        keyboardRows.add(keyboardSixthRow);
        keyboardRows.add(keyboardSeventhRow);
        keyboardRows.add(keyboardEighthRow);
        keyboardRows.add(keyboardNinthRow);
        //встановлюємо цей список нашій клавіатурі
        replyKeyboardMarkup.setKeyboard(keyboardRows);
        return replyKeyboardMarkup;
    }
    public ReplyKeyboardMarkup getKeyboardActionInEmergencies(){
        return keyboardActionInEmergencies();
    }
    //клавіатура повернення до дій під час надзвичайних ситуацій
    private ReplyKeyboardMarkup keyboardReturnActionInEmergencies(){
        //створюємо клавіатуру
        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        replyKeyboardMarkup.setSelective(true);
        replyKeyboardMarkup.setResizeKeyboard(true);
        replyKeyboardMarkup.setOneTimeKeyboard(false);
        //створюємо список рядків клавіатури
        List<KeyboardRow> keyboardRows = new ArrayList<>();
        //створюємо перший рядок
        KeyboardRow keyboardRow = new KeyboardRow();
        keyboardRow.add("2");
        keyboardRow.add("Меню");
        //встановлюємо всі рядки в наш список
        keyboardRows.add(keyboardRow);
        //встановлюємо цей список нашій клавіатурі
        replyKeyboardMarkup.setKeyboard(keyboardRows);
        return replyKeyboardMarkup;
    }
    public ReplyKeyboardMarkup getKeyboardReturnActionInEmergencies(){
        return keyboardReturnActionInEmergencies();
    }
    private String home(){
        return "ПОРАДИ ЩОДО ПІДГОТОВКИ ВДОМА\n" +
                "«Мій дім ― моя фортеця!». Цей вислів набуває особливого значення в надзвичайних ситуаціях. Незалежно від того, що саме спричинило кризу, для МІНІМАЛЬНОЇ ГОТОВНОСТІ варто задати собі кілька простих, але критичних питань:\n" +
                "\n" +
                "\uD83C\uDF5E ЧИ МАЮ Я ДОСТАТНІЙ ЗАПАС ХАРЧІВ І ПИТНОЇ ВОДИ?\n" +
                "\n" +
                "\uD83D\uDC8A ЧИ Є У МЕНЕ НЕОБХІДНІ МЕДИКАМЕНТИ?\n" +
                "\n" +
                "\uD83E\uDD76 ЧИ ЗМОЖУ Я СВОЇМИ СИЛАМИ ЗАБЕЗПЕЧИТИ ОБІГРІВ ОСЕЛІ В ХОЛОДНИЙ ПЕРІОД РОКУ?\n" +
                "Деякі питання варто продумати заздалегідь, аби краще обладнати своє житло на випадок надзвичайної ситуації і захистити себе і близьких:\n" +
                "\n" +
                "\uD83D\uDD39 за можливості дізнайтеся, де знаходяться найближчі укриття і перевірте стан підвального приміщення;\n" +
                "\n" +
                "\uD83D\uDD39 перевірте наявність аварійного виходу;\n" +
                "\n" +
                "\uD83D\uDD39 зробіть запаси питної та технічної води, продуктів тривалого зберігання;\n" +
                "\n" +
                "\uD83D\uDD39 перевірте наявність в аптечці засобів надання першої медичної допомоги і продумайте, які ліки можуть знадобитися протягом тривалого часу;\n" +
                "\n" +
                "\uD83D\uDD39 підготуйте засоби пожежогасіння;\n" +
                "\n" +
                "\uD83D\uDD39 подбайте про альтернативні засоби освітлення приміщення на випадок відключення енергопостачання (ліхтарики, свічки);\n" +
                "\n" +
                "\uD83D\uDD39 підготуйте засоби для приготування їжі у разі відсутності газу і електропостачання;\n" +
                "\n" +
                "\uD83D\uDD39 зберіть найнеобхідніші речі та документи на випадок термінової евакуації або переходу до сховищ;\n" +
                "\n" +
                "\uD83D\uDD39 подбайте про справний стан приватного транспорту і запас палива для вчасної евакуації з небезпечного району;\n" +
                "\n" +
                "\uD83D\uDD39 у холодну пору подумайте про альтернативний обігрів оселі на випадок відключення централізованого опалення.";
    }
    public String getHome() {
        return home();
    }
    private String minRisk(){
        return "\uD83D\uDEB8 Як мінімізувати ризик загубитись членам сім'ї:\n" +
                "\n" +
                "▫️ обговорити з членами родини план дій та домовитись, що треба робити, якщо загубився;\n" +
                "\n" +
                "▫️ визначити альтернативне місце зустрічі та період часу;\n" +
                "\n" +
                "▫️ пам'ятати про варіанти способів інформування членів сім'ї (записки, оголошення).\n" +
                "\n" +
                "Для вразливих категорій населення:\n" +
                "▫️ діти повинні знати власні ім’я, вік, імена батьків, домашню адресу;\n" +
                "\n" +
                "▫️ підпишіть речі дітей, літніх осіб, хворих тощо;\n" +
                "\n" +
                "▫️ у внутрішні кишені одягу варто покласти візитівку з інформацією про контактну особу.\n" +
                "\n" +
                "Обов’язково:\n" +
                "▫️ тримайте дитину тільки за руку. Коли дитина тримає вас за рукав чи за сумку, в натовпі їй дуже легко загубитися.\n" +
                "\n" +
                "▫️ пробираючись до місця призначення в натовпі людей, ведіть дітей перед собою;\n" +
                "\n" +
                "▫️ коли ви доїхали до потрібного вам місця, озирніться і назвіть дитині місце, де ви зустрінетеся, якщо розминетесь;\n" +
                "\n" +
                "▫️ завжди майте фотографію вашої дитини (в тому числі, на телефоні), бажано свіжу. За знімком перехожі легше його згадають і допоможуть швидко знайти.\n" +
                "\n" +
                "Уразі необхідності Служба розшуку Червоного Хреста України може прийняти звернення від громадян за телефонами:\n" +
                "+380 66 250 9957\n" +
                "+380 96 304 4375\n" +
                "та е-мейл  rfl@redcross.org.ua.\n" +
                "\n" +
                "Водночас активні дії з розшуку на даному етапі не проводяться.\n" +
                "\n" +
                "Джерело: https://www.facebook.com/RedCrossUkraine/";

    }
    public String getMinRisk(){
        return minRisk();
    }
    private String emergencySuitcasePartOne(){
        return "«Екстрена валіза» \uD83C\uDF92\n" +
                "\n" +
                "«Екстрена валіза» – це узагальнене визначення базового набору речей, необхідного кожній цивільній людині, щоб вижити в будь-якій екстремальній ситуації.\n" +
                "\n" +
                "Сьогодні «Екстрена валіза» (тривожний чемодан) повинна бути в кожній родині. Цивільний тривожний чемоданчик, як правило, являє собою укомплектований рюкзак об'ємом від 30 і більше літрів, що містить необхідний індивідуальний мінімум одягу, предметів гігієни, медикаментів, інструментів, засобів індивідуального захисту та продуктів харчування.\n" +
                "\n" +
                "Цивільний тривожний чемоданчик призначений для максимально швидкої евакуації із зони надзвичайної події, будь то землетрус, повінь, пожежа, загострена криміногенна обстановка, епіцентр військових дій і т.д.\n" +
                "\n" +
                "Укладайте рюкзак так, щоб можна було швидко і без ускладнень знайти потрібну річ. Добре, якщо рюкзак укомплектований спеціальною накидкою від дощу.\n" +
                "\n" +
                "Перевагу треба віддавати рюкзаку, який зручно розташовується на спині, не сковує рухів і не розійдеться по швах в перші 30 хвилин.\n" +
                "\n" +
                "У нього рекомендується покласти наступне:\n" +
                "\n" +
                "\uD83D\uDCC4 Копії важливих документів в водонепроникній упаковці. Заздалегідь зробіть копії всіх важливих документів – паспорта, автомобільних прав, документів на нерухомість, автомобіль і т.д. Документи треба укладати так, щоб у разі необхідності їх можна було швидко дістати. Серед документів варто тримати кілька фотографій рідних і близьких, з написаними на звороті адресами та номерами телефонів.\n" +
                "\n" +
                "\uD83D\uDCB6 \uD83D\uDCB3 Кредитні картки та готівку. Необхідно мати при собі  невеликий запас грошей.\n" +
                "\n" +
                "\uD83D\uDD11 \uD83D\uDDDD️ Дублікати ключів від будинку і машини.\n" +
                "\n" +
                "\uD83D\uDDFA️ Карту місцевості, а також інформацію про спосіб зв'язку і обумовлене місце зустрічі вашої родини.\n" +
                "\n" +
                "\uD83D\uDCFB \uD83D\uDCF1\uD83D\uDD0B Засоби зв'язку та інформації. Невеликий радіоприймач з можливістю прийому в УКХ і FM діапазоні дозволить бути в курсі ситуації. Запасні батарейки до радіоприймача та мобільний телефон з зарядним пристроєм.\n" +
                "\n" +
                "\uD83D\uDD26\uD83D\uDD26\uD83D\uDD26 Ліхтарик (краще кілька) і запасні батарейки до нього.\n" +
                "\n" +
                "\uD83E\uDDED ⌚️ Компас, годинник (перевагу віддавайте водонепроникним).\n" +
                "\n" +
                "\uD83D\uDEE0️ Мультитул – багатофункціональний інструмент, зазвичай у вигляді складних пасатижів з порожнистими ручками, в яких заховані додаткові інструменти (лезо ножа, шило, пила, викрутка, ножиці і т.п.)\n" +
                "\n" +
                "\uD83D\uDD2A Ніж, сокирка.\n" +
                "\n" +
                "\uD83D\uDCEF Сигнальні засоби (свисток  і т.д.)\n" +
                "\n" +
                "◾️ Штук п'ять пакетів для сміття, об'ємом 120 літрів. Може замінити намет або тент, якщо розрізати.\n" +
                "\n" +
                "◾️ Рулон широкого скотча.\n" +
                "\n" +
                "◾️ Шнур синтетичний 4-5мм, близько 20 м.\n" +
                "\n" +
                "\uD83D\uDCD3 ✏️ Блокнот і олівець.\n" +
                "\n" +
                "\uD83E\uDDF5 Нитки та голки.\n";
    }
    public String getEmergencySuitcasePartOne(){
        return emergencySuitcasePartOne();
    }
    private String emergencySuitcasePartTwo(){
        return "\uD83E\uDDF0 Аптечка першої допомоги. Аптечка повинна включати в себе: бинти, лейкопластир, вата, йод, активоване вугілля (інтоксикація), парацетамол (жарознижувальний), пенталгін (знеболююче), супрастин (алергія), іммодиум (діарея), фталазол (шлункова інфекція), альбуцид (очні краплі).\n" +
                "\n" +
                "\uD83D\uDC8A Ліки, які ви приймаєте (мінімум на тиждень) з описом способу застосування та дози; рецепти; прізвища та мобільні телефони ваших лікарів (слідкуйте за терміном придатності ліків).\n" +
                "\n" +
                "\uD83D\uDC5A \uD83D\uDC54 Одяг: комплект нижньої білизни (2 пари) , шкарпетки бавовняні (2 пари) і вовняні, запасні штани, сорочка або кофта, плащ-дощовик, в'язана шапочка, рукавички, шарф (може знадобитися в найнесподіваніших ситуаціях). Зручне, надійне взуття.\n" +
                "\n" +
                "\uD83E\uDDFC  Засоби гігієни: зубна щітка та паста, шматок мила, рушник , туалетний папір, кілька упаковок одноразових сухих хусток або серветок, кілька носових хусток, вологі серветки. Жінкам – засоби інтимної гігієни.\n" +
                "\n" +
                "\uD83D\uDEBC \uD83C\uDF7C Приналежності для дітей (якщо необхідні).\n" +
                "\n" +
                "\uD83E\uDD63 \uD83C\uDF7D️ Посуд: казанок, фляга, ложка, кружка (краще металеву 0,5л), розкладний стаканчик.\n" +
                "\uD83D\uDD25 Сірники (бажано, туристичні), запальничка.\n" +
                "\n" +
                "\uD83C\uDF5E\uD83C\uDF6C\uD83C\uDF6D\uD83C\uDF6B \uD83E\uDD6B\uD83C\uDF72 Запас їжі на кілька днів – все, що можна їсти без попередньої обробки і не займає багато місця та довго зберігається. Запас питної води на 1-2 дні, який треба періодично оновлювати (вода не повинна бути застояною). Висококалорійні солодощі: кілька батончиків «Snickers» або «Шок» (до цих пір використовуються тактичними групами, як джерело живлення і енергії, що володіє малою вагою), жменю льодяників. Набір продуктів: пару банок тушонки, галети, суп-пакети, м'ясні та рибні консерви. Якщо  дозволяє місце: крупа перлова, гречана, рис, пшоно, макарони, вермішель, сухі овочеві напівфабрикати і т. п. Горілка, вино, спирт питний. Алкоголь може бути засобом для зняття стресу, дезінфікуючим засобом.\n" +
                "\n" +
                "Цей список доповнюється і коригується за вашими потребами. Приблизний обсяг рюкзака становить близько 30 літрів. Вага рюкзака не повинна перевищувати 50 кг.";
    }
    public String getEmergencySuitcasePartTwo(){
        return emergencySuitcasePartTwo();
    }
    private String downloadAirAlarm(){
        return "Завантажити застосунок Повітряна тривога\n" +
                "\n" +
                "Встановіть застосунок Повітряна тривога, щоб миттєво отримувати сповіщення системи цивільної оборони у вибраній області України. Застосунок не потребує реєстрації та сповіщає про повітряну, хімічну, техногенну або інші види тривог системи цивільної оборони навіть у беззвучному режимі смартфона.\n" +
                "\n" +
                "iPhone: https://apps.apple.com/ua/app/повітряна-тривога/id1611955391\n" +
                "\n" +
                "Android: https://play.google.com/store/apps/details?id=com.ukrainealarm\n" +
                "\n" +
                "Щоб отримувати сповіщення:\n" +
                "1. Встановіть застосунок.\n" +
                "2. Надайте застосунку усі необхідні дозволи.\n" +
                "3. Виберіть область.\n" +
                "4. Отримуйте сповіщення про початок та кінець тривог.\n" +
                "\n" +
                "Доступні області:\n" +
                "◇ Вінницька\n" +
                "◇ Волинська\n" +
                "◇ Донецька\n" +
                "◇ Житомирська\n" +
                "◇ Закарпатська\n" +
                "◇ Київська\n" +
                "◇ Львівська\n" +
                "◇ Луганська\n" +
                "◇ Одеська\n" +
                "◇ Полтавська\n" +
                "◇ Рівненська\n" +
                "◇ Тернопільська\n" +
                "◇ Харківська\n" +
                "◇ Херсонська\n" +
                "◇ Хмельницька\n" +
                "◇ Чернівецька\n" +
                "◇ Чернігівська\n" +
                "та м. Херсон\n" +
                "\n" +
                "‼️‼️ Список областей постійно оновлюється ‼️‼️\n" +
                "\n" +
                "Це єдиний застосунок, що підтримує критичні сповіщення. Це означає, що звук тривоги буде завжди надходити з максимальним рівнем гучності смартфону. Для цього обов’язково надайте усі відповідні дозволи застосунку після встановлення.\n" +
                "\n" +
                "Важливо! Критичні сповіщення можна вимкнути в будь-який момент в налаштуваннях застосунку.\n" +
                "\n" +
                "Застосунок створено за підтримки Міністерства цифрової трансформації України. Автори ідеї застосунку — компанія Stfalcon";
    }
    public String getDownloadAirAlarm(){
        return downloadAirAlarm();
    }
    private String actionsDuringAirAlarm(){
        return "ЩО РОБИТИ ПІСЛЯ ОТРИМАННЯ СИГНАЛУ «УВАГА ВСІМ»\n" +
                "Якщо ви почули звуки сирен, переривчасті гудки підприємств або звуки гучномовця, що тривають протягом кількох хвилин, це означає попереджувальний сигнал «УВАГА ВСІМ».\n" +
                "\n" +
                "Якщо ти чуєш пульсуючий рев сирен протягом 3 хвилин\n" +
                "(рев протягом 9±1 секунд, 6±1 секунд тиші), це означає «Увага».\n" +
                "\n" +
                "\uD83D\uDD39 Увімкни ТБ або радіо, щоб почути інформацію / інструкції, та чітко їх виконуй.\n" +
                "\n" +
                "\uD83D\uDD39 Не вимикай радіо / ТБ.\n" +
                "\n" +
                "\uD83D\uDD39 Чекай подальших інструкцій по радіо / ТБ.\n" +
                "\n" +
                "ПІСЛЯ ОТРИМАННЯ ПОВІДОМЛЕННЯ МОЖЛИВІ НАСТУПНІ ВАРІАНТИ ДІЙ:\n" +
                "\n" +
                "ЗАЛИШАТИСЯ ВДОМА.\n" +
                "При цьому необхідно пристосувати своє житло. Повідомте отриману інформацію сусідам.\n" +
                "\n" +
                "ПЕРЕЙТИ ДО УКРИТТЯ АБО ЕВАКУЮВАТИСЯ В ІНШИЙ РАЙОН.\n" +
                "Перед виходом з будинку перекрийте газоелектрота водопостачання, зачиніть вікна і вентиляційні отвори. Візьміть з собою індивідуальні засоби захисту дихання і найнеобхідніші речі. Прямуйте до укриття або на збірний евакуаційний пункт. Допоможіть тим, хто потребує допомоги.";
    }
    public String getActionsDuringAirAlarm(){
        return actionsDuringAirAlarm();
    }
    private String actionsDuringWar(){
        return "ЩО РОБИТИ В НАДЗВИЧАЙНІЙ СИТУАЦІЇ АБО В ЗОНІ БОЙОВИХ ДІЙ\n" +
                "\n" +
                "Зберігайте спокій і концентрацію уваги. Від цього залежатиме, наскільки вправно і швидко ви зможете впоратися з кризою і мінімізувати її наслідки.\n" +
                "В кризових умовах проти вас діятимуть численні фактори, зокрема емоції. Тому пам’ятайте, що в критичний момент необхідно бути зібраними і сфокусованими, не реагувати на можливі провокації.\n" +
                "\n" +
                "ЯКЩО ВИ ОПИНИЛИСЯ В ЗОНІ БОЙОВИХ ДІЙ АБО ПОТРАПИЛИ В НАДЗВИЧАЙНУ СИТУАЦІЮ ЗА УЧАСТІ ОЗБРОЄНИХ ЛЮДЕЙ:\n" +
                "\n" +
                "\uD83D\uDD39 Не сповіщайте про свої майбутні дії і плани малознайомим людям, а також знайомим з ненадійною репутацією;\n" +
                "\n" +
                "\uD83D\uDD39  Завжди носіть з собою документ, що посвідчує особу. Гроші і документи тримайте в різних місцях ― так ви матимете більше шансів їх вберегти;\n" +
                "\n" +
                "\uD83D\uDD39 Тримайте біля себе записи про групу крові (свою та близьких родичів) та інформацію про можливі проблеми зі здоров’ям (наприклад, алергію на медичні препарати, хронічні захворювання);\n" +
                "\n" +
                "\uD83D\uDD39  Дізнайтеся, де розташовані сховища та укриття, найближчі до вашої оселі, роботи та місць, які ви часто відвідуєте;\n" +
                "\n" +
                "\uD83D\uDD39  Намагайтеся якнайменше знаходитись поза житлом і роботою, зменшіть кількість поїздок без важливої причини, уникайте місць скупчення людей;\n" +
                "\n" +
                "\uD83D\uDD39  При виході із приміщень дотримуйтесь правила правої руки і пропускайте вперед тих, хто потребує допомоги, ― це допоможе уникнути тисняви;\n" +
                "\n" +
                "\uD83D\uDD39 Не встрявайте у суперечки з незнайомими людьми ― це допоможе уникнути можливих провокацій;\n" +
                "\n" +
                "\uD83D\uDD39 У разі надходження інформації з офіційних каналів державних органів влади про можливу небезпеку передайте її іншим людям: родичам, сусідам, колегам;\n" +
                "\n" +
                "\uD83D\uDD39 При появі озброєних людей, військової техніки, заворушень негайно покиньте небезпечний район, якщо маєте таку можливість;\n" +
                "\n" +
                "\uD83D\uDD39 Уникайте колон техніки і не стійте біля військових машин, які рухаються;\n" +
                "\n" +
                "\uD83D\uDD39 Поінформуйте органи правопорядку, місцеві органи, військових про людей, які здійснюють протиправні і провокативні дії;\n" +
                "\n" +
                "\uD83D\uDD39 У разі потрапляння у район обстрілу сховайтеся у найближчому сховищі або укритті і не виходьте ще деякий час після закінчення обстрілу;\n" +
                "\n" +
                "\uD83D\uDD39 Якщо таких сховищ поблизу немає, використовуйте нерівності рельєфу (наприклад, канави, окопи, вирви від вибухів);\n" +
                "\n" +
                "\uD83D\uDD39 У разі раптового обстрілу та відсутності поблизу сховищ ― ляжте на землю головою в бік, протилежний до вибухів, і прикрийте голову руками або речами;\n" +
                "\uD83D\uDD39 Якщо поряд з Вами поранено людину, надайте першу допомогу і викличте швидку, представників ДСНС України, органів правопорядку, за необхідності ― військових. Не намагайтесь надати допомогу пораненим, поки не завершився обстріл;\n" +
                "\n" +
                "\uD83D\uDD39 Якщо ви стали свідком поранення або смерті людей, а також протиправних дій (наприклад, арешту, викрадення, побиття), спробуйте зберегти якнайбільше інформації про обставини подій.\n" +
                "\n" +
                "В ЖОДНОМУ РАЗІ НЕ ВАРТО\n" +
                "\uD83D\uDD39 наближатися до вікон, якщо почуєте постріли;\n" +
                "\n" +
                "\uD83D\uDD39 спостерігати за ходом бойових дій, стояти чи перебігати під обстрілом;\n" +
                "\n" +
                "\uD83D\uDD39 сперечатися з озброєними людьми, фотографувати і робити записи у їхній присутності;\n" +
                "\n" +
                "\uD83D\uDD39 демонструвати зброю або предмети, схожі на неї;\n" +
                "\n" +
                "\uD83D\uDD39 підбирати покинуту зброю та боєприпаси;\n" +
                "\n" +
                "\uD83D\uDD39 торкатися вибухонебезпечних та підозрілих предметів, намагатися розібрати їх чи перенести в інше місце ― натомість негайно повідомте про їхнє розташування територіальним органам ДСНС та Національній поліції за телефоном «101» та «102»;\n" +
                "\n" +
                "\uD83D\uDD39 носити армійську форму або камуфльований одяг ― краще вдягайте одяг темних кольорів, що не привертає уваги, і уникайте будьяких символів, адже вони можуть викликати неадекватну реакцію";
    }

    public String getActionsDuringWar(){
        return actionsDuringWar();
    }
    private String actionsDuringShelling(){
        return "ПІД ЧАС ОБСТРІЛУ СТРІЛЕЦЬКОЮ ЗБРОЄЮ:\n" +
                "\uD83D\uDD39 Під час стрілянини найкраще сховатися у захищеному приміщенні (наприклад, у ванній кімнаті або навіть у самій ванні). Коли це неможливо, варто лягти, прикрившись предметами, які здатні захистити вас від уламків і куль.\n" +
                "\n" +
                "\uD83D\uDD39 Якщо ви потрапили під стрілянину на відкритому місці, краще впасти на землю та закрити голову руками. Ефективним захистом буде будьякий виступ, навіть тротуар, заглиблення в землі або канава. Укриттям також може стати бетонна сміттєва урна або сходинки ґанку. Не намагайтеся сховатися за автомобілями або кіосками ― вони часто стають мішенями.\n" +
                "\n" +
                "\uD83D\uDD39 Де б ви не знаходились, тіло повинне бути у максимально безпечному положенні. Згрупуйтеся, ляжте в позу ембріона. Розверніться ногами у бік стрілянини, прикривши голову руками та відкривши рот, щоб близький вибух не завдав шкоди барабанним перетинкам. Чекайте, поки стрілянина не вщухне, а пострілів не буде бодай протягом 5 хвилин.\n" +
                "\n" +
                "\uD83D\uDD39 Якщо ваше житло перебуває в зоні регулярних збройних зіткнень, потрібно зміцнити вікна (наприклад, клейкою плівкою) ― це допоможе уникнути розльоту уламків скла. Бажано закрити вікна, наприклад, мішками з піском або масивними меблями.";
    }
    public String getActionsDuringShelling(){
        return actionsDuringShelling();
    }
    private String actionsDuringArtilleryShelling(){
        return "ПІД ЧАС АРТОБСТРІЛІВ:\n" +
                "\uD83D\uDD39 Під час артилерійського, мінометного обстрілу або авіаційного нальоту не залишайтеся в під’їздах, під арками та на сходових клітках. Також небезпечно ховатися у підвалах панельних будинків, біля автомобільної техніки, автозаправних станцій і під стінами будинків із легких конструкцій. Такі об’єкти неміцні, ви можете опинитись під завалом або травмуватися.\n" +
                "\n" +
                "\uD83D\uDD39 Якщо вогонь артилерії, мінометний обстріл, авіаційне бомбардування застали вас на шляху, негайно лягайте на землю, туди, де є виступ або хоча б у невелике заглиблення. Захист можуть надати бетонні конструкції (окрім тих, які можуть обвалитися або загорітися), траншеї, неглибокі підземні колодязі, широкі труби водостоку і канави.\n" +
                "\n" +
                "\uD83D\uDD39 Закривайте долонями вуха та відкривайте рот ― це врятує від контузії, убереже від баротравми.\n" +
                "\n" +
                "\uD83D\uDD39 Не приступайте до розбору завалів самостійно, чекайте фахівців з розмінування та представників аварійнорятувальної служби.\n" +
                "\n" +
                "ПІД ЧАС АРТИЛЕРІЙСЬКИХ ОБСТРІЛІВ СИСТЕМАМИ ЗАЛПОВОГО ВОГНЮ:\n" +
                "\uD83D\uDD39 Снаряд (ракету) можна помітити та зреагувати, залп реактивної установки добре видно. Вночі це яскравий спалах на обрії, а вдень ― димні сліди ракет;\n" +
                "\n" +
                "\uD83D\uDD39 Організуйте постійне спостереження, постійно тримайте у полі зору будівлі та споруди, які знаходяться поруч та які можливо використовувати як укриття. Після сигналу спостерігача є декілька секунд для того, щоб сховатись.\n" +
                "\n" +
                "\uD83D\uDD39 Ховайтеся у підвалі або в іншому заглибленому приміщенні. Вибирайте місце у кутку між несучими стінами та недалеко від вікон та дверей для того, щоб миттєво покинути будинок у випадку попадання снаряду.\n" +
                "\n" +
                "\uD83D\uDD39 Не виходьте з укриття, не почекавши хоча б 10 хвилин після завершення обстрілу, адже після залпу зазвичай ведеться уточнення результатів стрільби і коригування вогню або зміна позиції.";
    }
    public String getActionsDuringArtilleryShelling(){
        return actionsDuringArtilleryShelling();
    }
    private String firstAidKit(){
        return "ЩО МАЄ БУТИ В АПТЕЧЦІ\n" +
                "\n" +
                "За рекомендаціями Міністерства Охорони Здоров’я України аптечку слід укомплектувати відповідно до ваших потреб. Важливо перевірити заздалегідь термін придатності всіх препаратів.\n" +
                "\n" +
                "Базовий набір:\n" +
                "\uD83D\uDD39 сухий та медичний спирт;\n" +
                "\uD83E\uDDE4 2 пари гумових рукавичок;\n" +
                "\uD83D\uDD39 клапан з плівкою для проведення штучного дихання;\n" +
                "\uD83E\uDE79 засоби для зупинки кровотечі — турнікет, кровоспинний бинт з гемостатичним засобом;\n" +
                "\uD83E\uDE79 марлеві серветки різних розмірів і нестерильні марлеві бинти;\n" +
                "\uD83E\uDE79 еластичні бинти з можливістю фіксації;\n" +
                "\uD83E\uDE79 пластирі різних розмірів;\n" +
                "✂️ атравматичні ножиці для розрізання одягу на потерпілому;\n" +
                "\uD83D\uDD39 великий шматок тканини, якою можна зафіксувати кінцівку постраждалого;\n" +
                "\uD83D\uDD39 антисептичні засоби — дезінфікуючий засіб для рук, спиртові серветки.";
    }
    public String getFirstAidKit(){
        return firstAidKit();
    }
    private String childFear(){
        return "ЩО РОБИТИ, КОЛИ ДИТИНА ПІД ВПЛИВОМ СИЛЬНОГО СТРАХУ?\n" +
                "\uD83D\uDC99 Обов'язково взяти себе в руки\n" +
                "\n" +
                "\uD83D\uDEB0 ВМИТИ ВОдою дитину/дати випити води\n" +
                "\n" +
                "\uD83E\uDD17 Обійняти, пригорнути до себе, «згрібти в оберемок»\n" +
                "\n" +
                "\uD83D\uDDE3️ Говорити:\n" +
                "Подивись на мене, дивись в мої очі. \n" +
                "Дихай як я: зроби вдих, зроби видих, зроби вдих...\n" +
                "Я поруч. Я бачу, що тобі страшно. Я поруч з тобою. Ти злякалася. Зараз ти в безпеці.\n" +
                "Я зроблю усе, щоб захистити тебе.\n" +
                "Візьми мою руку. Стисни її.\n" +
                "Люблю тебе, я поруч.";
    }
    public String getChildFear(){
        return childFear();
    }
    private String explosiveObject(){
        return "Що робити, якщо ти помітив підозрілий предмет або вибухівку?\n" +
                "\n" +
                "\uD83D\uDCF9 подивіться відео: https://youtu.be/E4YeeFwQajo\n" +
                "\n" +
                "Будь обережний\n" +
                "\n" +
                "\uD83D\uDD39 Не торкайся його! Не намагайся розбирати його, не рухай і не переміщуй його, не кидай його, ніколи не намагайся самостійно визначити, що це.\n" +
                "\n" +
                "\uD83D\uDD39 Не пали і не користуйся мобільним телефоном поряд із підозрілим предметом.\n" +
                "\n" +
                "\uD83D\uDD39 Відійди від підозрілого предмета та сховайся за міцною спорудою, краще за будівлею.\n" +
                "\n" +
                "\uD83D\uDD39 Повідом поліцію про знахідку якомога швидше.\n" +
                "\n" +
                "\uD83D\uDD39 Зустрінь поліцейських, що приїдуть на виклик, оскільки ти – єдина людина, що зможе точно описати підозрілий предмет та показати точне місцезнаходження.\n" +
                "\n" +
                "\uD83D\uDD39 Не дозволяй іншим людям наближатися до підозрілого предмета, поки чекаєш на поліцію. Попередь людей, що знаходяться поруч, про необхідність переміститися у безпечне місце.\n" +
                "\n" +
                "\uD83D\uDD39 Якщо ти помітив підозрілий предмет у громадському транспорті, обов’язково попередь про це водія.\n" +
                "\n" +
                "Ляж на землю та прикрий голову руками, використовуй будь-яке доступне укриття.";
    }
    public String getExplosiveObject(){
        return explosiveObject();
    }
    private String threadOfExplosion(){
        return "У разі небезпеки вибуху\n" +
                "\n" +
                "☑️ ПІДТВЕРДЬТЕ\n" +
                "\n" +
                "\uD83D\uDD39 Залишайтеся в безпечному місці і нічого не торкайтеся , подумайте про реальну небезпеку вибуху.\n" +
                "\n" +
                "\uD83D\uDD39 Якщо ви не впевнені, то вважайте, що це небезпечно.\n" +
                "\n" +
                "\uD83D\uDD39 Використовуйте галерею зображень на цьому веб-сайті, щоб дізнатися, чи можете ви впізнати предмет, однак не має значення, якщо ви не можете його ідентифікувати.\n" +
                "\n" +
                "\uD83D\uDD39 Краще повідомити і дозволити фахівцеві провести ідентифікацію.\n" +
                "\n" +
                "\n" +
                "❌ ПОЗНАЧТЕ\n" +
                "\n" +
                "\uD83D\uDD39 Залишаючись у безпеці та не торкаючись вибухонебезпеки, намагайтеся вказати іншим, що місце має вибухонебезпечний та небезпечний характер.\n" +
                "\n" +
                "\uD83D\uDD39 Використовуючи будь-які доступні предмети, такі як червона стрічка, червона фарба, каміння в купі, схрещені палиці або знак, спробуйте вказати іншим, що місце має вибухонебезпечну небезпеку.\n" +
                "\n" +
                "\n" +
                "\uD83D\uDCF2 ПОВІДОМТЕ ПРО\n" +
                "\n" +
                "\uD83D\uDD39 Забезпечуючи безпеку , сфотографуйте предмет для кращої ідентифікації.\n" +
                "\n" +
                "\uD83D\uDD39 Потім також сфотографуйте загальну територію, щоб агентство з розвантаження побачило, де знаходиться предмет.\n" +
                "\n" +
                "\uD83D\uDD39 Заповніть форму звітності на цьому веб-сайті та надішліть свій звіт: https://www.ukraine-cat-uxo.com/report-your-uxo\n" +
                "\n" +
                "\uD83D\uDD39 Додайте невеликий опис розташування та будь-яку додаткову інформацію, на вашу думку, буде корисною.\n" +
                "\n" +
                "\n" +
                "\uD83D\uDEB7 ОБЛИШ\n" +
                "\n" +
                "\uD83D\uDD39 Не повертайтеся на місце.\n" +
                "\n" +
                "\uD83D\uDD39 Скажіть іншим триматися подалі.\n" +
                "\n" +
                "\uD83D\uDD39 Переміщення небезпеки може зайняти дні, тижні чи місяці.";
    }
    public String getThreadOfExplosion(){
        return threadOfExplosion();
    }
    private String actionsDuringHomeShelling(){
        return "❗️Як діяти при обстрілах житлових будинків? Правила порятунку:\n" +
                "\n" +
                "\uD83D\uDFE5 Сповіщення про тривогу буває двох видів: переривчаста сирена (чекайте, за 5 хвилин після сигналу канали повідомлять, що робити далі), безперервна сирена (треба негайно йти в укриття).\n" +
                "\n" +
                "\uD83D\uDFE5 Після сповіщення про повітряну тривогу треба вимкнути світло, газ, воду. Якщо є – від'єднати газовий балон, спустити тиск і покласти в безпечне місце.\n" +
                "\n" +
                "\uD83D\uDFE5 Найбільш небезпечні місця у будинку: перший, другий і третій поверхи (загроза потрапляння куль при обстрілах), останній поверх (небезпечний при повітряній тривозі), підвал (є ймовірність опинитись під завалами).\n" +
                "\n" +
                "\uD83D\uDFE5 Якщо залишились у квартирі, де сховатись: ванна кімната, якщо в ній немає газового котла або простір за двома глухими стінками.\n" +
                "\n" +
                "\uD83D\uDFE5 Що брати з собою в укриття: суху їжу щонайменше на 2 доби, воду (3 літри на особу), телефон з павербенком, ліхтарик. Бажано мати свисток для подачі сигналів.";
    }
    public String getActionsDuringHomeShelling(){
        return actionsDuringHomeShelling();
    }
    private String radiationMap(){
        return "Інформація про радіаційний фон\n" +
                "Карта: https://www.saveecobot.com/ru/radiation-maps";
    }
    public String getRadiationMap(){
        return radiationMap();
    }
    private String actionsDuringRadiationEmergency(){
        return "Твої дії у випадку радіаційної загрози:\n" +
                "\n" +
                "\uD83D\uDD39  Не панікуй, попередь сусідів та родичів.\n" +
                "\n" +
                "\uD83D\uDD39  Залишайся у закритому приміщенні, а якщо опинився на вулиці –\n" +
                "зайди у приміщення.\n" +
                "\n" +
                "\uD83D\uDD39  Якомога швидше закрий всі вікна, вентиляційні отвори, двері та димоходи. Як тільки все закрив, загерметизуй усі дверні та віконні отвори клейкою стрічкою або папером. Металопластикові вікна та двері зачиняються дуже щільно, тож додаткова герметизація не потрібна.\n" +
                "\n" +
                "\uD83D\uDD39  Вимкни системи вентиляції, подачі повітря, кондиціонери та системи обігріву повітря.\n" +
                "\n" +
                "\uD83D\uDD39  Якщо у тебе є домашні тварини, забери їх всередину приміщення.\n" +
                "\n" +
                "\uD83D\uDD39  Поклади їжу у герметичні контейнери, банки або пластикові пакети. Овочі поклади у коробки, зсередини обкладені папером та плівкою, та накрий їх брезентом або іншим щільним матеріалом.\n" +
                "\n" +
                "\uD83D\uDD39  Не покидай приміщення без потреби. Якщо потреба виникла, намагайся не вдихати радіоактивний пил. Захисти свої органи дихання: прикрий рот та ніс одноразовою маскою, рушником або складеною хустинкою. Якщо маєш, використовуй респіратор або протигаз;\n" +
                "\n" +
                "\uD83D\uDD39Зберігай питну воду у щільно закритих ємностях чи банках.\n" +
                "\n" +
                "\uD83D\uDD39 Май запас стабільних йодовмісних препаратів (йодид калію чи йодат\n" +
                "калію).\n" +
                "\n" +
                "\uD83D\uDD39 Якщо у тебе є домашні тварини, заведи їх у закрите приміщення.\n" +
                "\n" +
                "\uD83D\uDD39 Закрий криниці.\n" +
                "\n" +
                "\uD83D\uDD39Після повернення додому прийми душ, перевдягнись у чистий одяг, поклади забруднений одяг у пластикові пакети та прибери його з житлового приміщення.\n" +
                "\n" +
                "\uD83D\uDD39 Підготуйся до можливої евакуації.";
    }
    public String getActionsDuringRadiationEmergency(){
        return actionsDuringRadiationEmergency();
    }
    private String chemicalEmergency(){
        return "Твої дії у випадку хімічної загрози:\n" +
                "\n" +
                "\uD83D\uDD39 Залиш зону зараження якомога швидше.\n" +
                "\n" +
                "\uD83D\uDD39 Прямуй перпендикулярно напрямку вітру (вітер має дути збоку) та\n" +
                "обходь низини.\n" +
                "\n" +
                "\uD83D\uDD39 Захисти дихальні шляхи, прикривши ніс та рот одноразовою маскою, вологим рушником або хустинкою. Використовуй респіратор, якщо він у тебе є.\n" +
                "\n" +
                "\uD83D\uDD39 Захисти шкіру – одягни водонепроникний одяг та взуття.\n" +
                "\n" +
                "\uD83D\uDD39 Захисти свої дихальні шляхи: закрий та загерметизуй вікна свого житлового приміщення, вентиляційні отвори, піднімись на верхні поверхи будинку.\n" +
                "Після повернення додому прийми душ, переодягнись в чистий одяг, поклади забруднений одяг у пластикові пакети та прибери його з житлового приміщення.\n" +
                "\n" +
                "\uD83D\uDD39 Залишайся у закритому приміщенні, якщо немає змоги покинути забруднену територію.\n" +
                "\n" +
                "\uD83D\uDD39 Закрий та загерметизуй вікна твого житла (квартири чи приватного будинку) клейкою стрічкою або іншими засобами, загерметизуй отвори вентиляційної системи ганчір’ям або папером, закрий вхідні двері вологою тканиною;\n" +
                "\n" +
                "\uD83D\uDD39 Піднімись на верхні поверхи будинку – багато небезпечних речовин важчі за повітря і збираються у низинах.\n" +
                "\n" +
                "\uD83D\uDD39 Не покидай приміщення без потреби.\n" +
                "\n" +
                "\uD83D\uDD39 Підготуйся до можливої евакуації.\n" +
                "\n" +
                "\uD83D\uDD39 Не панікуй, попередь сусідів та родичів.";
    }
    public String getChemicalEmergency(){
        return chemicalEmergency();
    }
    private String actionsDuringReturnHomeAfterRadiation(){
        return "Заходи безпеки при поверненні з зони хімічного / біологічного / радіаційного забруднення:\n" +
                "\n" +
                "\uD83D\uDD39 Уникай фізичного контакту з членами родини, щоб не передати забруднення їм.\n" +
                "\n" +
                "\uD83D\uDD39 Зніми весь одяг, у який був вдягнений в зоні забруднення.\n" +
                "\n" +
                "\uD83D\uDD39 Знімай одяг у напрямку від голови до ніг: спочатку куртку, потім сорочку або блузку, і штани або спідницю в кінці. Не знімай одяг через голову, щоб не перенести забруднення на обличчя та в очі.\n" +
                "\n" +
                "\uD83D\uDD39 Склади одяг забрудненою поверхнею всередину, поклади у пакети (в один, потім ще в один) і поклади у безпечне місце. Пізніше тебе проінструктують щодо подальших дій з цим одягом.\n" +
                "\n" +
                "\uD83D\uDD39 Спочатку вимий руки, потім обличчя, шию, очі та вуха, прочисти ніс та промий рот, ретельно вимий кожну частину тіла.\n" +
                "\n" +
                "\uD83D\uDD39 Добре помийся у душі гарячою (38-40°C) водою або холодною водою з милом (краще з господарським).\n" +
                "\n" +
                "\uD83D\uDD39 Мийся протягом 3-5 хвилин, а при радіаційному забрудненні упродовж 10 хвилин.";
    }
    public String getActionsDuringReturnHomeAfterRadiation(){
        return actionsDuringReturnHomeAfterRadiation();
    }
    private String disinformation(){
        return "ЯК НЕ СТАТИ ЖЕРТВОЮ ДЕЗІНФОРМАЦІЇ\n" +
                "В умовах військової агресії Україна вимушена протидіяти ворожій пропаганді та дезінформації. Агресивні дії з боку Росії мають на меті дестабілізувати наше суспільство та дискредитувати керівництво країни, змусити нас сумніватися у своїх силах і готовності захищатися.\n" +
                "Питання інформаційної безпеки набуває особливого значення в умовах кризи, адже ворожі інформаційні атаки стають інтенсивнішими саме тоді, коли здатність суспільства чинити опір послаблено. Найкраще підґрунтя для ворожих операцій впливу ― страх, паніка, дезорієнтація. Тому важливо дотримуватися базових правил інформаційної гігієни і бути особливо пильними до інформації, яка надходить і яку поширюєте ви самі.\n" +
                "\n" +
                "ЗАЗДАЛЕГІДЬ УПЕВНІТЬСЯ:\n" +
                "\uD83D\uDD39 що маєте доступ до інформації з офіційних каналів державних органів, а також\n" +
                "\uD83D\uDD39 що в разі необхідності зможете підтримувати зв’язок зі своїми близькими.\n" +
                "\n" +
                "Убезпечте себе і оточуючих від інформаційних загроз\n" +
                "ЗАДУМАЙТЕСЯ,\n" +
                "хто і з якою метою поширює інформацію:\n" +
                "\n" +
                "❓ чи є ця інформація на офіційних ресурсах держави? \n" +
                "❓ для чого ця інформація з’явилася саме зараз?\n" +
                "❓ це думка чи факт?\n" +
                "❓ чи повідомляють про це інші джерела?\n" +
                "\n" +
                "ДОТРИМУЙТЕСЬ 10 ПОРАД:\n" +
                "1️⃣  Мета поширювачів дезінформації — посіяти паніку, послабити нашу волю до оборони. Не допомагайте їм, допомагайте собі: зберігайте самоконтроль і не поширюйте інформацію емоційного характеру в соцмережах.\n" +
                "\n" +
                "2️⃣ Україна захищається та продовжує боротьбу за свою територію. Якщо ви чуєте протилежне — це неправда. Вас хочуть деморалізувати.\n" +
                "\n" +
                "3️⃣ Не вірте і не поширюйте інформацію із сумнівних джерел. Достовірна інформація — на офіційних сторінках і каналах державних органів та Суспільного мовлення.\n" +
                "\n" +
                "4️⃣ Жодним чином не поширюйте інформацію про переміщення українських військ. Ви можете нашкодити тим, хто захищає вас і державу.\n" +
                "\n" +
                "5️⃣ Україна веде оборонну війну на своїй території. Повідомлення про нібито обстріли мирного населення українськими військовими — неправда. Ворог хоче підірвати вашу довіру до власних захисників.\n" +
                "\n" +
                "6️⃣ Агресор поширюватиме різні чутки не лише про бійців, а й про військовополітичне керівництво, аби українці не довіряли і йому. Але довіряти не можна саме ворогу — його емоційним провокаціям і повідомленням, які неможливо перевірити. Звіряйте кожну тривожну новину з офіційними джерелами.\n" +
                "\n" +
                "7️⃣ Інформацію про втрати можуть знати лише органи безпеки та оборони України. Інформація на приватних акаунтах може не відповідати дійсності. Не поспішайте ділитись такою інформацією.\n" +
                "\n" +
                "8️⃣ Агресор поширюватиме наклепи і «зраду» через свої офіційні чи підконтрольні канали. А може використовувати й інші засоби — прикриватись патріотичними гаслами і українською символікою. Перевіряйте патріотичні на вигляд, але сумнівні повідомлення та заклики.\n" +
                "\n" +
                "9️⃣ Мета ворога — розколоти українське суспільство зсередини і знищити нашу віру у власні сили. Ми дійсно різні й наші погляди можуть не збігатися, але ми маємо спільну справу — дати відсіч окупанту. Тому зберігайте єдність і підтримуйте одне одного.\n" +
                "\n" +
                "\uD83D\uDD1F Якщо перервався інтернетзв’язок або сторінки державних органів були зламані, звертайтесь по інформацію до Суспільного мовлення. Якщо не працює телебачення — вмикайте абонентську радіоточку.";
    }
    public String getDisinformation(){
        return disinformation();
    }
    private String communicationPartOne(){
        return "Інструкція щодо альтернативних способів виклику екстрених служб та комунікації між громадянами (абонентами) за відсутності стільникового зв’язку\n" +
                "\n" +
                "Якщо ваш апарат стільникового зв’язку (мобільний телефон) тривалий час знаходиться за межами дії мережі мобільного оператора, перш за все перевірте його справність. Якщо гаджет справний, то це свідчить про відсутність мережі зв’язку на певній території або місцевості. Іноді проблеми можуть бути лише з одним оператором мобільного зв’язку (пошкоджена вежа, обладнання тощо), тому рекомендовано мати при собі SIM-карти інших операторів із активним станом рахунку.\n" +
                "\n" +
                "За умови повної відсутності мобільних мереж задля здійснення екстрених викликів та комунікації між абонентами існують декілька альтернативних варіантів:\n" +
                "1️⃣ Основною альтернативою стільниковому (мобільному) зв’язку є засоби стаціонарного дротового електрозв’язку (стаціонарні телефони). За наявності стаціонарного телефонного апарату у вашому помешканні, або у помешканні ваших сусідів (знайомих, друзів), буде забезпечено безперебійний зв’язок з екстреними службами та іншими абонентами стаціонарного і мобільного зв’язку, за умови якщо вони знаходяться в зоні дії стільникової мережі;\n" +
                "\n" +
                "2️⃣ За відсутності доступу до стаціонарних засобів телефонного зв’язку необхідно встановити наявність доступу до мережі Internet (понад 93 % мешканців міст та 55% сільської місцевості використовують засоби Internet-зв’язку). Internet – це, свого роду, також дротовий зв'язок. Якщо в наслідок військових дій не порушено цілісності існуючі мережі, то з використанням Internet та за допомогою систем миттєвого обміну текстовими, голосовими, відео- та фото повідомленнями (месенджери) можливо встановити зв’язок з бажаним абонентом. Необхідно прослідкувати, чи на засобах зв’язку (мобільний телефон, планшетний ПК, ноутбук тощо) встановлені відповідні месенджери (WhatsApp, Telegram, Viber, Signal, Messenger facebook, Instagram тощо). За необхідності виклику екстрених служб за допомогою будь якого месенджеру, попередньо необхідно дізнатись номера телефонів за якими зареєстровано роботу месенджерів відповідних служб або посилання на профілі офіційних сторінок в соціальних мережах. Цю інформацію попередньо можливо почерпнути на офіційних сайтах регіональних (територіальних) представництв екстрених служб (відомств) або зателефонувавши за номерами 101, 102, 103, 104, 112.\n" +
                "\n" +
                "3️⃣ Існує можливість використання мобільних телефонів для зв’язку з визначеними абонентами за відсутності доступу до телефонної мережі та мережі Internet. Для цього на мобільний пристрій необхідно попередньо встановити спеціальні месенджери. Радіус дії таких месенджерів варіюється від 60 до 100 метрів і залежить від можливих перешкод, оскільки найчастіше їхня робота побудована на основі технології Bluetooth. Попри декларовані розробниками характеристики, за наявності щільної забудови, складного рельєфу місцевості або перебуванні у підвальному приміщенні, дальність зв’язку може зменшуватись до кількох метрів. Однак повідомлення можливо передати й далі, якщо ними користується більша кількість абонентів. Тоді вони утворюють коміркову мережу, і ваше повідомлення може буде передано ланцюгом через пристрої інших абонентів, які використовують ті ж месенджери, та досягти одержувача.\n" +
                "До таких додатків відносять: Berkanan Messenger (платна); Briar; Rumble; FireChat; Bridgefy.\n" +
                "\n" +
                "Слід пам’ятати, що перелічені програми необхідно завантажити заздалегідь, за наявності стабільного доступу до мережі Internet, а також обов’язково протестувати їх працездатність.\n" +
                "Коротка довідка щодо встановлення та особливостей використання: https://lviv.nashigroshi.org/2022/02/24/mesendzhery-bez-internetu-shho-robyty-yakshho-znykne-mobilnyj-zv-yazok-ta-internet/?fbclid=IwAR1MUqI3kr-EEyrtPeFQpO6qDM8sdIUPJwiOlJoz3_cpNuj02nwCNZfHIIE";
    }
    public String getCommunicationPartOne(){
        return communicationPartOne();
    }
    private String communicationPartTwo(){
        return "4️⃣ Використання мобільних телефонів як засобів радіозв’язку. За допомогою певних застосунків, мобільний телефон можливо використовувати за прикладом рації. Слід врахувати, що у цьому випадку ваше спілкування не буде приватним. Його зможе прослухати будь-хто, якщо випадково чи навмисно потрапить на ту саму частоту. Перевага у тому, що ви можете бути на зв’язку одночасно з усіма учасниками діалогу. Для організації такого зв’язку потрібно завчасно встановити одну із існуючих програм та домовитись з абонентами про частоту для спілкування.\n" +
                "\n" +
                "До таких додатків відносять: Voxer Walkie Talkie, Walkie Talkie, Two Way: Walkie Talkie\n" +
                "Слід пам’ятати, що перелічені програми необхідно завантажити заздалегідь, за наявності стабільного доступу до мережі Internet, а також обов’язково протестувати їх працездатність.\n" +
                "\n" +
                "5️⃣ За неможливості доступу до попередньо перелічених засобів зв’язку рекомендовано із дотриманням заходів власної безпеки здійснити переміщення до найближчого об’єкту, який обладнано засобами стаціонарного телефонного зв’язку та/або радіозв’язку. Об’єктами, які обов’язково обладнано стаціонарними засобами телефонного зв’язку є адміністрації органів місцевого самоврядування, відділення пошти, школи, дитячі садки та інші заклади освіти, пожежно-рятувальні частини, відділки поліції, станції швидкої медичної допомоги, станції аварійної газової служби, представництва інших силових відомств (Нацгвардія, СБУ, ЗСУ, Поліція охорони тощо).\n" +
                "\n" +
                "Якщо ви бажаєте підтримувати зв’язок із близьми та рідними за допомогою альтернативних засобів зв’язку, подбайте про це завчасно. Дізнайтесь де є найближчий апарат стаціонарного телефонного зв’язку, дізнайтесь його номер, передайте близьким людям. Виконати аналогічну процедуру попросіть своїх близьких та рідних. Встановіть місце знаходження найближчих об’єктів із наявними засобами стаціонарного телефонного або радіозв’язку. Подбайте про справність власних гаджетів та наявності відповідних застосунків (месенджерів, програм тощо).\n" +
                "\n" +
                "Загалом в екстремальній ситуації у випадку повної відсутності зв'язку експерти та надзвичайні служби України радять завчасно придбати невеличкий радіоприймач для ультракоротких та FM-хвиль, а також елементи живлення для нього. Такий гаджет дозволить отримувати важливі повідомлення від уряду чи місцевої влади, якщо вам доведеться покинути дім або у вас не буде інших засобів зв'язку. На випадок, якщо в кризовій ситуації ні у вас, ні у ваших близьких не буде жодних технічних засобів зв'язку, потрібно попередньо чітко домовитись про місце та час зустрічі. Якщо ви плануєте евакуацію в якесь конкретне місце - визначте точку та час збору і домовтесь, що будете чекати там, наприклад, протягом 24 годин, а потім вирушите далі до наступного пункту призначення. Маленьким дітям варто покласти в кишеню або вшити в одяг записку із повним ім'ям дитини, її батьків чи інших контактних осіб, адресу та телефони. Дітей шкільного віку варто попередити, як діяти в разі, якщо не буде зв'язку.";
    }
    public String getCommunicationPartTwo(){
        return communicationPartTwo();
    }
}
