package LDUBGD.DSNS.services;

public class WeaponsAndAmmunition {
    private String actionsFindWeapons(){
        return "Що робити, якщо ти помітив підозрілий предмет або вибухівку?\n" +
                "\n" +
                "Будь обережний\n" +
                "\n" +
                "\uD83D\uDD39 Не торкайся його! Не намагайся розбирати його, не рухай і не переміщуй його, не кидай його, ніколи не намагайся самостійно визначити, що це.\n" +
                "\n" +
                "\uD83D\uDD39 Не пали і не користуйся мобільним телефоном поряд із підозрілим предметом.\n" +
                "\n" +
                "\uD83D\uDD39 Відійди від підозрілого предмета та сховайся за міцною спорудою, краще за будівлею.\n" +
                "\n" +
                "\uD83D\uDD39 Повідом поліцію про знахідку якомога швидше.\n" +
                "\n" +
                "\uD83D\uDD39 Зустрінь поліцейських, що приїдуть на виклик, оскільки ти – єдина людина, що зможе точно описати підозрілий предмет та показати точне місцезнаходження.\n" +
                "\n" +
                "\uD83D\uDD39 Не дозволяй іншим людям наближатися до підозрілого предмета, поки чекаєш на поліцію. Попередь людей, що знаходяться поруч, про необхідність переміститися у безпечне місце.\n" +
                "\n" +
                "\uD83D\uDD39 Якщо ти помітив підозрілий предмет у громадському транспорті, обов’язково попередь про це водія.\n" +
                "\n" +
                "Використовуючи клавіатуру нище можна ознайомитись з видами \"підозрілих об'єктів\" чи вибухівок.\"";
    }
    public String getActionsFindWeapons(){
        return actionsFindWeapons();
    }
}
